# TransactionGroup Constructor (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TransactionGroup Constructor
TransactionGroup Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| TransactionGroup(Document) | Constructs a transaction group object. |
| TransactionGroup(Document, String) | It constructs a transaction group object |

# See Also
TransactionGroup Class
TransactionGroup Members
Autodesk.Revit.DB Namespace